## ----setup, include=FALSE---------------------------------------------
library(tidyverse)
knitr::opts_chunk$set(echo = TRUE)


## ---------------------------------------------------------------------
1+1
2+3*4; (2+3)*4 #複数の式を１行で実行　セミコロン「;」, べき乗「^」
5^2


## ---------------------------------------------------------------------
A <- 6-1
A; A^2
B <- c(6,7,8) #複数要素の格納, c(a,b,c...)→各要素それぞれ計算
(B-1)/2


## ---------------------------------------------------------------------
read.csv("data.csv") #オブジェクトへの格納→Environmentにて確認
df <- read.csv("data.csv")
head(df) #中身の確認


## ---------------------------------------------------------------------
mean(df$age); sd(df$age); min(df$age); max(df$age) #$: 一つの項目だけ取り出す

